{
  "architectures": [
    "PanguEmbeddedForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_openpangu_dense.PanguEmbeddedConfig",
    "AutoModel": "modeling_openpangu_dense.PanguEmbeddedModel",
    "AutoModelForCausalLM": "modeling_openpangu_dense.PanguEmbeddedForCausalLM"
  },
  "bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "pad_token_id": 0,
  "eos_token_id": 45892,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "max_position_embeddings": 32768,
  "model_type": "PanguEmbedded",
  "num_attention_heads": 12,
  "num_hidden_layers": 26,
  "num_key_value_heads": 6,
  "rms_norm_eps": 1e-05,
  "rope_theta": 4000000.0,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.2",
  "use_cache": true,
  "vocab_size": 153376
}
